import type { Testimonial } from '@/interfaces/testimonial'

export const data: Array<Testimonial> = [
  {
    id: 1,
    title: 'Толық оқу материалдары',
    content:
      'Миссдананың IELTS-ке дайындық курсы менің күткенімнен асып түсті! Жекелендірілген зейін мен жан-жақты материалдар маған күткеннен әлдеқайда жоғары балл жинауға көмектесті.',
    user: {
      id: 1,
      name: 'Luis Sera',
      professional: 'IELTS 7.5',
      photo: '1.jpg',
    },
  },
  {
    id: 2,
    title: 'Үздік Сапалы Онлайн Курс!',
    content:
      'Мен Миссдананың IELTS курсын міндетті түрде ұсына алмаймын! Нұсқаушылар керемет білімді және қолдау көрсетеді, сенімділікті арттыратын және табысқа жетуді қамтамасыз ететін оң оқу ортасын жасайды.',
    user: {
      id: 1,
      name: 'Riski',
      professional: 'IELTS 7.5',
      photo: '2.jpg',
    },
  },
  {
    id: 3,
    title: 'Өте терең түсіндіру',
    content:
      'Миссдананың IELTS-ке дайындық курсының арқасында мен мақсатты баллымды рекордтық мерзімде жинай алдым! Құрылымдық оқу жоспары мен сарапшылардың ұсыныстары менің үлгерімімді түбегейлі өзгертті.',
    user: {
      id: 1,
      name: 'Nguyễn Văn',
      professional: 'IELTS 7.5',
      photo: '3.jpg',
    },
  },
  {
    id: 4,
    title: 'Өте сапалы!',
    content:
      'Миссданадағы IELTS курсына жазылу мен қабылдаған ең жақсы шешімдердің бірі болды! Нұсқаушылар бөліскен стратегиялар мен кеңестер баға жетпес болды, бұл менің ағылшын тілін меңгеруімнің айтарлықтай жақсаруына әкелді.',
    user: {
      id: 1,
      name: 'Diana Jordan',
      professional: 'IELTS 7.5',
      photo: '4.jpg',
    },
  },
  {
    id: 5,
    title: 'Толық оқу материалдары',
    content:
      'Миссдананың IELTS-ке дайындық курсы өте жақсы! Қызықты сабақтардан бастап практикалық материалдардың көптігіне дейін барлық аспектілер студенттерге емтихандарда жақсы нәтиже көрсетуге көмектесу үшін жасалған.',
    user: {
      id: 1,
      name: 'Ashley Graham',
      professional: 'IELTS 7.5',
      photo: '5.jpg',
    },
  },
]
